Tekla Open API Reference for Tekla Structures 2025
Picker.PickFace Method
Overload List
Name | Description
PickFace()
 Queries the user to pick a face from the model.
PickFace(String)
 Queries the user to pick a face from the model with the given prompt.
Top
See Also
Reference
Picker Class
Tekla.Structures.Model.UI Namespace